Results/Verifications/S2427/bottleneck-determination/update_index/threads-32/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=32 oltp_update_index --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-ty
pe=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 5546.22 qps: 5546.22 (r/w/o: 0.00/5402.79/143.43) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 5465.31 qps: 5465.31 (r/w/o: 0.00/5331.91/133.40) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 5462.08 qps: 5462.08 (r/w/o: 0.00/5333.38/128.70) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 5555.39 qps: 5555.39 (r/w/o: 0.00/5415.28/140.11) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 5119.43 qps: 5119.43 (r/w/o: 0.00/4991.03/128.40) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 4747.34 qps: 4747.34 (r/w/o: 0.00/4630.14/117.20) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 4557.13 qps: 4557.13 (r/w/o: 0.00/4445.13/112.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 5149.60 qps: 5149.60 (r/w/o: 0.00/5028.60/121.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 5072.00 qps: 5072.00 (r/w/o: 0.00/4943.60/128.40) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 5173.90 qps: 5173.90 (r/w/o: 0.00/5043.11/130.79) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           505711
        other:                           12835
        total:                           518546
    transactions:                        518546 (5184.70 per sec.)
    queries:                             518546 (5184.70 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0103s
    total number of events:              518546

Latency (ms):
         min:                                    1.15
         avg:                                    6.17
         max:                                  305.72
         95th percentile:                       10.09
         sum:                              3199274.77

Threads fairness:
    events (avg/stddev):           16204.5625/37.37
    execution time (avg/stddev):   99.9773/0.00


real    1m40.162s
user    0m8.410s
sys     0m20.435s